In [1]:
import pandas as pd
import numpy as np

In [2]:
#1 #2
dataset = pd.read_csv('titanic.csv')
test_dataset = pd.read_csv('titanic_test.csv')

In [3]:
#3
train_data = dataset[['Age', 'Fare']].dropna()

In [4]:
#3
naIsTrue = dataset[['Age', 'Fare']].isna()
tempIsNa = naIsTrue[naIsTrue["Age"] == True]
tempIsNa1 = naIsTrue[naIsTrue["Fare"] == True]

pos_missing_train = np.append(tempIsNa1.index, tempIsNa.index)

In [5]:
#4
test_data = test_dataset[['Age', 'Fare']].dropna()

In [6]:
#4
naIsTrue2 = test_dataset[['Age', 'Fare']].isna()
tempIsNa2 = naIsTrue2[naIsTrue2["Age"] == True]
tempIsNa3 = naIsTrue2[naIsTrue2["Fare"] == True]

pos_missing_test = np.append(tempIsNa3.index, tempIsNa2.index)

In [7]:
test_data

      Age      Fare
0    34.5    7.8292
1    47.0    7.0000
2    62.0    9.6875
3    27.0    8.6625
4    22.0   12.2875
..    ...       ...
409   3.0   13.7750
411  37.0   90.0000
412  28.0    7.7750
414  39.0  108.9000
415  38.5    7.2500

[331 rows x 2 columns]

In [8]:

label_data

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [9]:
label_data = pd.read_csv('titanic_testlabel.csv')
test_label = label_data.drop(pos_missing_test)
test_label = test_label[['Survived']]

In [10]:
test_label

     Survived
0           0
1           1
2           0
3           0
4           1
..        ...
409         1
411         1
412         1
414         1
415         0

[331 rows x 1 columns]

In [11]:
train_label = dataset.drop(pos_missing_train)
train_label = train_label[['Survived']]
train_label

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
885         0
886         0
887         1
889         1
890         0

[714 rows x 1 columns]

In [12]:
def min_max_scaling(data):
    
    data_norm = data.copy()
    
    for column in data_norm.columns:
        data_norm[column] = (data_norm[column] - data_norm[column].min()) / (data_norm[column].max() - data_norm[column].min())
        
    return data_norm

In [33]:
norm_train_data = min_max_scaling(train_data)
min_train_age = np.array(norm_train_data['Age']).min()
max_train_age = np.array(norm_train_data['Age']).max()
min_train_fare = np.array(norm_train_data['Fare']).min()
max_train_fare = np.array(norm_train_data['Fare']).max()

In [34]:
norm_train_data

          Age      Fare
0    0.271174  0.014151
1    0.472229  0.139136
2    0.321438  0.015469
3    0.434531  0.103644
4    0.434531  0.015713
..        ...       ...
885  0.484795  0.056848
886  0.334004  0.025374
887  0.233476  0.058556
889  0.321438  0.058556
890  0.396833  0.015127

[714 rows x 2 columns]

In [35]:
print("Min Age : ")
print(min_train_age)
print("")
print("Max Age : ")
print(max_train_age)
print("")
print("Min Fare : ")
print(min_train_fare)
print("")
print("Max Fare : ")
print(max_train_fare)

Min Age :
0.0

Max Age :
1.0

Min Fare :
0.0

Max Fare :
1.0

In [36]:
norm_test_data = min_max_scaling(test_data)
min_test_age = np.array(norm_test_data['Age']).min()
max_test_age = np.array(norm_test_data['Age']).max()
min_test_fare = np.array(norm_test_data['Fare']).min()
max_test_fare = np.array(norm_test_data['Fare']).max()

In [37]:
norm_test_data

          Age      Fare
0    0.452723  0.015282
1    0.617566  0.013663
2    0.815377  0.018909
3    0.353818  0.016908
4    0.287881  0.023984
..        ...       ...
409  0.037320  0.026887
411  0.485692  0.175668
412  0.367005  0.015176
414  0.512066  0.212559
415  0.505473  0.014151

[331 rows x 2 columns]

In [38]:
print("Min Age : ")
print(min_test_age)
print("")
print("Max Age : ")
print(max_test_age)
print("")
print("Min Fare : ")
print(min_test_fare)
print("")
print("Max Fare : ")
print(max_test_fare)

Min Age :
0.0

Max Age :
1.0

Min Fare :
0.0

Max Fare :
1.0

In [39]:
from sklearn.neighbors import KNeighborsClassifier

In [95]:
kNN=KNeighborsClassifier(n_neighbors=10, weights='distance')

In [96]:
kNN.fit(norm_train_data, train_label)
class_result = kNN.predict(norm_test_data)
class_result

<ipython-input-96-8a1a71bacdbb>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  kNN.fit(norm_train_data, train_label)

array([0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1,
       1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0,
       0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1,
       0], dtype=int64)

In [97]:
precision_ratio=kNN.score(norm_test_data, test_label)

In [98]:
error_ratio=1-precision_ratio

In [99]:
error_ratio

0.4169184290030211